index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-24 Пт 07:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Slides for astynax's talks</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="astynax" />
</head>
<body>
<div id="content">
<style>
body { color: #073642; background-color: #fdf6e3; }
a { color: #268bd2; }
table tr:nth-child(odd) td { background-color: #eee8d5; }
</style>
<p>
Slides for <a href="https://github.com/astynax">astynax</a>'s talks:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">2016/10</td>
<td class="org-left">Фронтенд + Elm = Фронтенд - pain</td>
<td class="org-left"><a href="./elm_minus_pain.html">HTML</a></td>
</tr>

<tr>
<td class="org-left">2016/10</td>
<td class="org-left">The Elm Architecture: model, view &amp; update your UI (FPConf'16)</td>
<td class="org-left"><a href="./tea_fpconf2016.html">HTML</a></td>
</tr>

<tr>
<td class="org-left">2017/04</td>
<td class="org-left">react-flux: React-powered Web GUI на Haskell (ruHaskell Meetup '17)</td>
<td class="org-left"><a href="./react-flux_ruhaskell2017.html">HTML</a></td>
</tr>

<tr>
<td class="org-left">2017/10</td>
<td class="org-left">Reactive Programming (для meetup.com/progmsk)</td>
<td class="org-left"><a href="./reactive.html">HTML</a></td>
</tr>

<tr>
<td class="org-left">2018/02</td>
<td class="org-left">Elm и The Elm Architecture: что это и зачем это всё? (FProg Spb)</td>
<td class="org-left"><a href="./elm-wtf.html">HTML</a></td>
</tr>

<tr>
<td class="org-left">2019/02</td>
<td class="org-left">Функциональное программирование: цели, способы, применимость</td>
<td class="org-left"><a href="./2019-about-fp.pdf">PDF</a></td>
</tr>

<tr>
<td class="org-left">2019/05</td>
<td class="org-left">Функциональный дизайн и паттерны ФП</td>
<td class="org-left"><a href="./fp-patterns.html">HTML</a></td>
</tr>
</tbody>
</table>
</div>
</body>
</html>
